app/controllers/api/problems_controller.rb

    def create
      @problem = Problem.create(problem_params)
---
INSERT INTO "problems" ("answer", "wrong_answer_1", "wrong_answer_2", "wrong_answer_3", "question", "topic_id", "created_at", "updated_at", "hint") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)