app/controllers/api/topics_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."name" = ?  [["name", "Ruby"]]
---
    def index
      @topics = Topic.where(name: "Ruby")

INSERT INTO "topics" ("name", "high_score", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "JavaScript"], ["high_score", 0], ["user_id", 1], ["created_at", "2021-01-21 17:30:59.260005"], ["updated_at", "2021-01-21 17:30:59.260005"]]
---
    def create
      @topic = Topic.create(topic_params)